## pop
- 说明：  
    - 从DataFrame中删除指定的列，并返回该列作为Series。
    - 注意该操作会修改原DataFrame。
- 参数： 
    - `item`: str  
    要删除并返回的 列标签 或 index

```python
pandas.DataFrame.pop(item) -> pandas.DataFrame
pandas.Series.pop(item) -> pandas.Series
```

In [17]:
import pandas as pd

df = pd.DataFrame(
    [
        ('falcon', 'bird', 389.0),
        ('parrot', 'bird', 24.0),
        ('lion', 'mammal', 80.5),
        ('monkey', 'mammal',),
    ],
    columns=('name', 'class', 'max_speed'),
)
df

     name   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [18]:
df.pop('class')

0      bird
1      bird
2    mammal
3    mammal
Name: class, dtype: object

In [19]:
df

     name  max_speed
0  falcon      389.0
1  parrot       24.0
2    lion       80.5
3  monkey        NaN

In [20]:
df.name.pop(1)

'parrot'

In [22]:
df.name

0    falcon
2      lion
3    monkey
Name: name, dtype: object